#+title: Teoría de los lenguajes de Programación
#+author: Jordi Amposta Pérez
#+LATEX_HEADER: \usepackage{tikz}

#+startup: latexpreview content

*** Tabla de símbolos
:PROPERTIES:
:ID:       c05d9849-2e4d-45ad-a766-71109e308b53
:END:
- [[id:TeLenProg]] pag 188
- La tabla de símbolos contiene un conjunto de identificadores y para cada uno de ellos una pila con las declaraciones asociadas a él.
      - Las declaraciones en la cima de la pila son las visibles en cada momento.
      - Así se asegura que al salir de bloque el anterior vínculo se restrablezca.
- Ejemplos de la tabla de símbolos (en el libro hay más).

| Identificador | Pila (cima)                               |             |
|---------------+-------------------------------------------+-------------|
| x             | double local de p                         | int global  |
| y             | int array local de un bloque anidado en p | char global |
| p             | void función                              |             |

- Tabla de símbolos según aparece durante la ejecución, *alcande dinámico*.
      - [[id:TeLenProg]] pag 191 un ejemplo
      - Es dificil de implementar y produce problemas.
            - La semántica de una función puede cambiar según avanza la ejecución.
            - No pueden definirse el tipo de datos de las variables.
      - Puede ser válido para lenguajes muy dinámicos en los que no se hagan programas grandes.
- Ejemplo del alcance dinámico en elisp.

#+begin_src elisp
(defun A ()
  (setq-local a "soy a"))

(defun B ()
  (A)
  (message "Desde B : %s" a))

(B)
#+end_src

#+RESULTS:
: Desde B : soy a

- Mantener una sola tabla única para todo el programa con inserciones es propia de lenguajes simpres como C o Pascal.
      - Aún así existen excepciones en C.
      - los estructs contienen subtablas con las declaraciones de sus miembros.
      - Estas subtablas no pueden eliminarse hasta que que la "variable" struct sea eliminada.
            - Esto es al final del programa.

#+begin_src C
struct {
    int a;
    char b;
    double c;
} x = {1, 'a', 2.2};

void p () {
    struct {  // aunque no accesible esta definición queda almacenada
                //  hasta el final del programa.
        double a;
        int b;
        char c;
    } y={1.2, 3, 'b'};
}

void q () {
    /* struct B var = {0.0, 3, 'q'}; */
    /* struct A var = {0, 'q', 0.2}; */
}

void main() {
}
#+end_src

*** Asignación, tiempo de vida y ambiente
:PROPERTIES:
:ID:       bccb71cd-1ae0-46a9-8f52-1989b118ae06
:END:
- [id:TeLenProg] pag 196
- *El ambiente* se encarga de mantener los vínculos de los identificadores con las localizaciones de memoria.
- En general en un lenguaje con estructura de bloques:
      - Los identificadores de las variables globales se asignan estáticamente porque su significado es fijo en el programa.
      - Los identificadores de las variables locales se asignan dinámicamente cuando la ejecución llega al bloque.
- _En el ambiente se mantiene una estructura de pila para vincular las localizaciones a las variables_.
      - Cada posición en la pila es una dirección en memoria para el bloque.
            - Memoria contigua dentro del bloque no contigua con otros bloques.
- *objeto* : Área de almacenamiento asignada en el ambiente tras el procesamiento de una declaración.
      - El *tiempo de vida* o *extensión* de un objeto es la duración de su asignación en el ambiente.
- Lenguajes con *punteros* es necesaria una extensión del ambiente.
      - Y mecanismos para la asginación de memoria.

#+begin_src C
#include <stdlib.h>
#include <stdio.h>

int main(void) {
    int * x = NULL;

    x = (int*) malloc(sizeof(int));
    
    free(x);

    printf("end example");

    return 0;
}
#+end_src

#+RESULTS:
: end example

- Para permitir la asignación arbitraria de memoria el ambiente debe tener un área enla memoria para ello (*montículo*, heap), se conoce como *asignación dinámica*.
      - *Asignación automática* cuando no es en el heap (stack).
- *clases de almacenamiento* : en un lenguaje con estructura por bloques ser refiere a la correspondencia con los tipos de asignación de localizaciones en el ambiente.
      - Estático (variables globales), automático (variables locales), dinámico (para asignación de montículos).

#+begin_src C :results output
#include <stdlib.h>
#include <stdio.h>

int p(void) {
    static int p_count=0; // Se inicia una sola vez, aunque el alcanze es local.
    p_count +=1;
    int x=0;

    // cuidado con las asignaciones en bloques if
    if (x=p_count) {
        printf("Destruction, x=%d\n", x);
    }

    return p_count;
}

int q(int a) {

    const int b = 7 + 2 * 2;
    const int c = a+b;

    int arr[a];

    printf("Value b : %d\n", b);
    printf("Value c : %d\n", c);
    
}

int main(void) {
    p();
    q(10);
    q(20);
    return 0;
}
#+end_src

#+RESULTS:
: Destruction, x=1
: Value b : 11
: Value c : 21
: Value b : 11
: Value c : 31

*** Variables y constantes
- [id:TeLenProg] pag 201
- atributos de una variable
      - identificador
      - localización
      - valor
      - otros
- *valor r* : Valor almacenado (esto en c++ es muy usado para las operaciones de std::move)
- *valor l* : Localización de una variable
- *Asignación por compartición* : copia las localizaciones no los valores.
- *Asignación por clonación* : Copia el valor en una localización nueva.
- *Semántica de puntero* : no la entiendo muy bien
      - Dice que lo usa Lisp e imagino que se refiere a la de C.
- *Semántica de almacenamiento* : La más habitual
- Las *constantes* tienen semántica de valor, porque nunca cambian.
      - 77 o "a" se reconocen como constantes pero se denominal *literales*.
            - Para distinguirlas de las constantes declaradas en el programa.
- Clasificiación de las constantes:
      - *Constantes estáticas* : Cuyo valor se puede calcular antes de la ejecución (constexpr en C++).
            - *Constantes en tiempo de compilación*.
                  - Mejoran la eficiencia y no consumen memoria.
            - *Constatnes estáticas* : se calculan en la carga del programa.
      - *Constantes dinámicas* : Cuyo valor solo se puede computar en tiempo de ejecución.
- En java *final* es la palabra clave para definir constantes.
- En casi todos los lenguajes las definiciones de *funciones* son definiciones de constantes, cuyos valores son funciones.

#+begin_src C :results output
#include <stdlib.h>
#include <stdio.h>

int gcd (int u, int v) {
    if (v==0) return u;
    else return gcd(v, u % v);
}

typedef int(*FuncType)(int,int);

int main(void) {
    // asignación de una función a una variable.
    FuncType fun_var = gcd;

    printf("gcd %d\n", fun_var(15,10));
    return 0;
}
#+end_src

#+RESULTS:
: gcd 5

*** Evaluación de una expresión
- *Evaluación impaciente* o *Evaluación estricta* : operandos o parámetros han de ser evaluados antes de los operadores o funciones.
- *Efecto colateral* : Problemas que surgen del orden de resolución de llamadas aparentemente no conectadas.

#+begin_src java
static int x;

static int colateral () {
    x++;
    return x;
}

public static void main(String[] args) {
    x=1;
    int y = x + colateral();
    System.out.println(y);

    x=1;
    int z = colateral() + x;
    System.out.println(z);
}
#+end_src

#+RESULTS:
: 3
: 4

- Si el lenguaje establece el orden de resolución el programador puede tenerlo en cuenta para evitar efectos colaterales.

- *Evaluación no estricta* o *evaluación diferida* : La evaluación de los parámetros de una función se difieren hasta que sea necesarios.
- *Transparencia referencial* : El valor de una expresión o parámetro no varía según cuando sea resuelto.
      - *Evaluación normal* : Si se cumple la transparencia referencial una función puede empezar a ser evaluada antes que sus operandos.
- *Evaluación perezosa* : lo de Haskell. Se retrasa hasta tener toda la información suficiente par la evaluación de la función.
- *Evaluación en cortocircuito* o *evalueción McCarthy* :
      - false AND x : no es necesario evaluar x
      - true or x : no es necesario evaluar x
      - Permite proteger de realizar accesos a componentes inexistentes. 
- *Operadores ansiosos* : Lenguajes como Fortran sin evaluación en cortocircuito.
- *if-then-else* : operador ternario también se puede evaluar en cortocircuito.
      - c ? t : e
- Expresiones *case* : extensión de las expresiones *if* con más de dos opciones posibles.
      - Primero se evalue la expresión de control
      - Luego se comprueba en que patrón encaja.

*** Sentencias if-then-else
- if (e) then s1 [else s2]
- Muchos lenguajes omiten la palabra then.
- Primero se evalua *e*
      - Si resulta verdadero se ejecuta s1
      - Sino si existe un bloque else se ejecutará s2.
- *Problema del else ambiguo* : Aparece con anidamientos de ifs
      - if (e1) then if (e2) then s1 else s2  // A que if pertenece el else?
      - Algunos lenguajes optan por asociar el else al if más cercano.

#+begin_src java :results output
if (true) System.out.println("IF 1");
    if (false) System.out.println( "IF 2");
    else System.out.println("Sentencia Else");
#+end_src

#+RESULTS:
: IF 1

- *elseif* : Permite trabajar con múltiples alternativas al mismo nivel.
      - Se evalua $e_i$, si resulta falsa se evalua $e_{i+1}$.
      - Si ningún $e_i$ resulta verdadero se evalua el *else*.
#+begin_example
if (e1) {}
elsif (e2) {}
...
else {}
#+end_example

- Una expresión siembre debe devolver un valor, una sentencia no es necesario.

